# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных ИНДЕКСАХ. Пять ИНДЕКСОВ хранятся в списке, который вы сами заполняете.
# Пример списка ИНДЕКСОВ [2, 4, 3, 1, 8]
#Ввод: 10
#[-10, -9, ...-4, -3, -2, -1, 0, 1, 2, 3,4....10]

from pickle import APPEND
from random import randint


numbers = list[2, 4, 3, 1, 8]
for i in range(10):
     numbers = randint(-10, 10)
     print(numbers)